""" #####################################################
発想

N_list = list(range(1, N+1))が与えられる。
Pi は任意で定義できる。
i をPiで割るときの余りの最大

N_list[i] % Pi[i] である。

N <= 10**9 なので、logNか何か傾向を見つけないと解けなさそう。

i = 1, 2 = M+M
Pi= 2, 1 = 1+0 = 0
Pi= 1, 2 = 0+0 = 0

余りの最大数。
i = 1,2,3,4,5,6,7,8,9,10,11,12,13 
Pi= 2,3,4,5,6,7,8,9,10,11,12,13,1
  = 1,2,3,4,5,6,7,8,9,10,11,12,0
  = 78

答え= [-1] = 0 としたときのsum(N_list)である
N = 1: 0 
N = 2: 1
N = 3: 3
N = 4: 6 (3+2+1) = N*(N-1)//2
N = 13: 78 : 13*12//2 = 13*6 = 78





##################################################### """
def check() :
    print(sum(range(13)))
    return


def main() :
    N = int(input())
    if N == 1 : print(0)
    else : print(N*(N-1)//2)
    return


if __name__ == "__main__" :
    main()
    #check()
